<!DOCTYPE html>
<html lang="ja">
<head>
	<meta charset="UTF-8">
	<title>WORK11</title>
</head>
<body>
	<?php
		//$strResult = ""; // 結果文字列

		//----------------------------------------
		// 課題１
		//----------------------------------------
		print("<p>課題①--------</p>");
		
		// 1～100までループ
		for( $i = 1 ; $i <= 100 ; $i++ ):
			// 3の倍数かつ4の倍数の時
			if( $i % 3 == 0 && $i % 4 == 0 ):
				print("<p>Fizz Buzz</p>");
			// 3の倍数の時
			elseif( $i % 3 == 0 ):
				print("<p>Fizz</p>");
			// 4の倍数の時
			elseif( $i % 4 == 0 ):
				print("<p>Buzz</p>");
			else: // 数値の時
				print("<p>".$i."</p>");
			endif;
		endfor;

		//----------------------------------------
		// 課題２
		//----------------------------------------
		print("<p>課題②--------</p>");
		
		// iを1～9までループ
		for( $i = 1 ; $i <= 9 ; $i++ ):
			// jを1～9までループ
			for( $j = 1 ; $j <= 9 ; $j++ ):
				print("<p>".$i."*".$j."=".( $i * $j )."</p>");
			endfor;
		endfor;

		//----------------------------------------
		// 課題３
		//----------------------------------------
		print("課題③--------</p>");
		
		for( $i = 1 ; $i <= 10 ; $i++ ):
			$strAsterisk = "";
			
			print("!"."</p>");

			for( $j = 1 ; $j <= $i ; $j++ ):
				$strAsterisk .= "*";
			endfor;

			print( $strAsterisk."</p>" );
		endfor;
	?>
</body>
</html>
