<?php

//========================================================================
//------------------------------------------------------------------------
// アイテム一覧ページ Controller
//------------------------------------------------------------------------
//========================================================================

//------------------------------------------------------------------------
// Model
//------------------------------------------------------------------------
require_once( "../../include/ec_site/model/item_model.php" );
require_once( "../../include/ec_site/model/cart_model.php" );

//------------------------------------------------------------------------
// Controller
//------------------------------------------------------------------------

//===============================================
// POSTチェック 
//===============================================
function checkPost( $db, &$strItemMsg )
{
	// リクエストメソッドがPOSTじゃない時
	if( $_SERVER["REQUEST_METHOD"] != "POST" )
	{
		dprint( "POSTじゃない");
		return 0;
	}

	// カートへの追加の時
	if( isset( $_POST["add_cart"] ) )
	{
		dprint( "カートへの追加");
		addCart( $db, $strItemMsg );
		return 0;
	}
}

// セッション開始
session_start();

// ログイン中じゃない時
if( false == isset( $_SESSION["user_name"] ) )
{
	// ログイン中ではない場合は、index.phpにリダイレクト（転送）する
	header('Location: index.php');
	exit();
}

// 先ずDBに接続する
$db = connectDB();

$strItemMsg = ""; // アイテムメッセージ

// POSTチェック 
checkPost( $db, $strItemMsg );

// アイテムデータの取得
$arrItemData = getItemData( $db );

//------------------------------------------------------------------------
// View
//------------------------------------------------------------------------
include_once( "../../include/ec_site/view/item_list_view.php" );
