<?php
//------------------------------------------------------------------------
// Model
//------------------------------------------------------------------------
require_once "../../include/model/work39_model.php";


//------------------------------------------------------------------------
// Controller
//------------------------------------------------------------------------
// ページタイプ
$ePageType = E_PAGE_TYPE_IMAGE_LIST;	// 初期は画像一覧

// 先ずDBに接続する
$pdo = connectDB();

// ページタイプが設定されてたら
if( false != isset( $_GET["page_type"] ) )
{
	$ePageType = $_GET["page_type"];
}

// 画像投稿ページの時
if( $ePageType == E_PAGE_TYPE_IMAGE_UPLOAD )
{
	// POSTチェック 
	checkPost( $pdo );
}

// 表示データの取得
$arrViewData = getViewData( $pdo );


//------------------------------------------------------------------------
// View
//------------------------------------------------------------------------
include_once "../../include/view/work39_view.php";
